[
    {
        "title": "Respond - Thank you to all our contributors",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Contributors Thank you to everyone who helps build and support Respond.",
        "keywords": "",
        "callout": "",
        "url": "contributors",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T15:03:10.0Z"
    },
    {
        "title": "Respond - Build fast, responsive sites with Respond CMS",
        "description": "Demo placeholder page",
        "text": "Demo The demo will be available sometime during beta. For now, check out our Tour.",
        "keywords": "",
        "callout": "",
        "url": "demo",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T15:19:38.0Z"
    },
    {
        "title": "Developer Experience ",
        "description": "Learn how Respond makes development easy.",
        "text": "Developer Experience Inevitably, your client is going to ask to maintain all or portion of their site. And, you have to make a decision. Do I spend hours converting my site to some obscure CMS theme format? Do I give up on code quality and my curated build tools?&nbsp;",
        "keywords": "",
        "callout": "",
        "url": "developer-experience",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-28T23:31:56.0Z"
    },
    {
        "title": "Respond - Creating Plugins",
        "description": "Learn how to create plugins for Respond",
        "text": "Creating Plugins Plugins are a great way to extend Respond to meet the needs of your users. Packaged with Themes Plugins in Respond are packaged with your themes. This gives you flexibility to design the HTML produced by the plugins to meet the needs of your site and front-end framework. You create plugins in the resources\/themes\/theme-name\/plugins folder. When a site is created, the plugin is copied to public\/sites\/site-name\/plugins Plugins are created as HTML files (e.g. form.html). The file name of the plugin is import because it acts as an ID for the plugin. Referencing Plugins in Code The respond-plugin attribute is used to tell the system that the code contained within an element is generated by a plugin. &lt;div respond-plugin type=\"form\" form=\"contact-us\"&gt;&lt;\/div&gt; In the above example, the plugin is set to a type of form. This tells Respond to pull the code from public\/sites\/site-name\/plugins\/form.html. Enabling Plugins in the Respond Editor You can enable the Respond visual editor to show your plugin by adding the following JavaScript to resources\/themes\/theme-name\/.private\/plugins.js. The file is copied to resources\/sites\/site-name\/plugins.js when the site is created. { action: \"respond.form\", selector: \"[respond-plugin][type=form]\", title: \"Form\", display: '&lt;svg xmlns=\"http:\/\/www.w3.org\/2000\/svg\" viewBox=\"0 0 24 24\" height=\"100%\" width=\"100%\"&gt;&lt;path d=\"M0 0h24v24H0z\" fill=\"none\"\/&gt;&lt;path d=\"M19 3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.11 0 2-.9 2-2V5c0-1.1-.89-2-2-2zm-9 14l-5-5 1.41-1.41L10 14.17l7.59-7.59L19 8l-9 9z\"\/&gt;&lt;\/svg&gt;', view: '&lt;div class=\"respond-plugin\"&gt;&lt;svg xmlns=\"http:\/\/www.w3.org\/2000\/svg\" viewBox=\"0 0 24 24\" height=\"100%\" width=\"100%\"&gt;&lt;path d=\"M0 0h24v24H0z\" fill=\"none\"\/&gt;&lt;path d=\"M19 3H5c-1.11 0-2 .9-2 2v14c0 1.1.89 2 2 2h14c1.11 0 2-.9 2-2V5c0-1.1-.89-2-2-2zm-9 14l-5-5 1.41-1.41L10 14.17l7.59-7.59L19 8l-9 9z\"\/&gt;&lt;\/svg&gt;&lt;span&gt;' + hashedit.i18n('Form') + '&lt;\/span&gt;&lt;\/div&gt;', html: '&lt;div respond-plugin type=\"form\" form=\"contact-us\"&gt;&lt;\/respond-form&gt;', attributes: [ { attr: 'form', label: 'Form', type: 'select', values: ['respond.forms'] } ] } Setting Description action A unique identifier for your plugin. selector The CSS selector by which your plugin can be accessed by the editor. Typically, this will be [respond-plugin][type=plugin] where plugin is the name of your plugin. title The title of the plugin. Shown when the icon is hovered over. display The HTML display of the icon shown in the toolbar in the Respond editor. view (optional) Specifies \"default\" HTML that is replaced by the editor. This is recommended when the plugin contains dynamic data that should not be edited by the user. attributes The attributes allow you to configure the configure modal for the plugin. Each configurable item is mapped to an attribute on the plugin HTML. For example, in the form plugin, the form attribute sets the form attribute in the plugin HTML. More on Attributes Attributes are the primary means to pass data from the user to the plugin. They can pass plain text or specify the name of the form, gallery, or page to be used by the plugin. Setting Description attr The name of the HTML attribute to be set on the plugin. label The label for the field shown in the configure element modal type This can be set to text or select to show a text field or select field. values (if select is set as type) An array of values to be added on the select list. This can be a simple array of strings (e.g. ['Option 1','Option 2','Option 3']) or can be set as ['respond.forms'], ['respond.galleries'], ['respond.routes'], or ['respond.pages']. These special values automatically populate the select box with items created in Respond. Plugin Structure Plugins can be a simple as creating plain HTML. In fact, you can just specify the HTML in the plugins.json file. However, to get the full power of accessing Respond data, you need to use TWIG templates. The Twig templates allow you to access data in the system. An example of the form plugin is shown below. {% spaceless %} {% for form in forms %} {% if form.id == attributes.form %} &lt;form id=\"{{ form.id }}\" action=\"{{ site.api }}\" data-site=\"{{ site.id }}\" respond-form&gt; {% for field in form.fields %} &lt;div class=\"form-group\" data-id=\"{{ field.id }}\" data-label=\"{{ field.label }}\" data-type=\"{{ field.type }}\" data-required=\"{{ field.required }}\"&gt; &lt;label for=\"{{ field.id }}\" class=\"control-label\"&gt;{{ field.label }}&lt;\/label&gt; {% if field.type == 'text' %} &lt;input id=\"{{ field.id }}\" name=\"{{ field.id }}\" type=\"text\" placeholder=\"{{ field.placeholder }}\" class=\"form-control\"&gt; {% endif %} {% if field.type == 'textarea' %} &lt;textarea id=\"{{ field.id }}\" name=\"{{ field.id }}\" placeholder=\"{{ field.placeholder }}\" class=\"form-control\"&gt;&lt;\/textarea&gt; {% endif %} {% if field.type == 'select' %} {% set options = field.options|split(',') %} &lt;select id=\"{{ field.id }}\" name=\"{{ field.id }}\" class=\"form-control\"&gt; {% for option in options %} &lt;option value=\"{{ option }}\"&gt;{{ option }}&lt;\/option&gt; {% endfor %} &lt;\/select&gt; {% endif %} {% if field.type == 'checkboxlist' %} {% set options = field.options|split(',') %} &lt;span class=\"radio list\"&gt; {% for option in options %} &lt;label class=\"radio\"&gt;&lt;input name=\"{{ field.id }}\" type=\"checkbox\" value=\"{{ option }}\"&gt;&lt;span&gt;{{ option }}&lt;\/span&gt;&lt;\/label&gt; {% endfor %} &lt;\/span&gt; {% endif %} {% if field.type == 'radiolist' %} {% set options = field.options|split(',') %} &lt;span class=\"checkbox list\"&gt; {% for option in options %} &lt;label class=\"checkbox\"&gt;&lt;input name=\"{{ field.id }}\" type=\"radio\" value=\"{{ option }}\"&gt;&lt;span&gt;{{ option }}&lt;\/span&gt;&lt;\/label&gt; {% endfor %} &lt;\/span&gt; {% endif %} {% if field.helperText != '' %} &lt;span class=\"help-block\"&gt;{{ field.helperText }}&lt;\/span&gt; {% endif %} &lt;\/div&gt; {% endfor %} {% endif %} {% endfor %} &lt;button type=\"submit\" class=\"btn btn-primary\"&gt;Submit&lt;\/button&gt; &lt;span class=\"loading\"&gt; &lt;!-- ack: https:\/\/github.com\/jxnblk\/loading --&gt; &lt;svg xmlns=\"http:\/\/www.w3.org\/2000\/svg\" viewBox=\"0 0 32 32\"&gt;&lt;g&gt;&lt;path opacity=\".25\" d=\"M16 0 A16 16 0 0 0 16 32 A16 16 0 0 0 16 0 M16 4 A12 12 0 0 1 16 28 A12 12 0 0 1 16 4\"\/&gt;&lt;path d=\"M16 0 A16 16 0 0 1 32 16 L28 16 A12 12 0 0 0 16 4z\"&gt;&lt;animateTransform attributeName=\"transform\" type=\"rotate\" from=\"0 16 16\" to=\"360 16 16\" dur=\"0.8s\" repeatCount=\"indefinite\" \/&gt;&lt;\/path&gt;&lt;\/g&gt;&lt;\/svg&gt; &lt;\/span&gt; &lt;span class=\"success\"&gt;Form submitted successfully&lt;\/span&gt; &lt;span class=\"error\"&gt;There was an error submitting your form&lt;\/span&gt; &lt;\/form&gt; {% endspaceless %} Form Data Forms are created in the Forms UI in Respond. The following data is passed into the forms array passed to your plugin. Setting Description id The ID of the created form. name The name of the form. cssClass This CSS class of the form. fields An array of fields created on the form. Fields contain the following information. Setting Description id The ID of field label The label of the field. type This type of the field (text, textarea, select, checkboxlist, radiolist) required Set to \"true\" or \"false\" if the field is required. options A comma separated list of options available to the select, checkboxlist or radiolist types. helperText Any helper text set on the form field. placeholder The placeholder text set on text fields. cssClass The CSS class for the field. Gallery Data Galleries are created in the Galleries UI in Respond. The following data is passed into the galleries array passed to your plugin. Setting Description id The ID of the created gallery. name The name of the gallery. images An array of images created on the gallery. Images contain the following information. Setting Description id The generated id for the image. name The filename of the image. url The relative URL to the image. thumb The relative URL to the thumb of the image. caption A user-specified caption for the image. Menu Data Menus are created in the Menus UI in Respond. The following data is passed into the menus array passed to your plugin. Setting Description id The ID of the created menu. name The name of the menu. items An array of menu items created on the menu. The items contain the following information. Setting Description cssClass The css class for the menu item isNested Set to \"true\" or \"false\" as to whether the menu item is nested in the parent. html The HTML to be displayed in the menu item label. url The relative URL to which the menu item is linked. Pages Data Pages are created in the Pages UI in Respond. The following data is passed into the pages array passed to your plugin. Setting Description title The title of the page. description The description of the page. text Plain text for the main content in the page. html The HTML for the main content in the page. keywords Keywords for the page. callout Callout text for the page. url The relative URL of the page. photo The relative photo URL for the first image in the main content of the page. thumb The relative thumb URL for the first image in the main content of the page. language The language of the page. direction The direction (rtl or ltr) of text on the page. firstName The first name of the last user to modify the page. lastName The last name of the last user to modify the page. lastModifiedBy The email of the last user to modify the page. lastModifiedDate The date of the last modification to the page (e.g. 2016-06-09T19:49:27.0Z). Current Page Data The following data is passed into the page array passed to your plugin. It contains information about the current page. Setting Description title The title of the page. description The description of the page. keywords Keywords for the page. callout Callout text for the page. url The relative URL of the page. photo The relative photo URL for the first image in the main content of the page. thumb The relative thumb URL for the first image in the main content of the page. language The language of the page. direction The direction (rtl or ltr) of text on the page. firstName The first name of the last user to modify the page. lastName The last name of the last user to modify the page. lastModifiedBy The email of the last user to modify the page. lastModifiedDate The date of the last modification to the page (e.g. 2016-06-09T19:49:27.0Z). Current Site Data The following data is passed into the site array passed to your plugin. It contains information about the current site. Setting Description id The unique id (also the folder name) for the site. name The name of the site (when created). email The primary email of the site. api The URL to the API for the app.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/creating-plugins",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Creating themes",
        "description": "Learn how to create themes for Respond",
        "text": "Creating Themes This tutorial will provide you with everything you need to know about themes in&nbsp;Respond. This tutorial includes the location of themes, creating a new theme, and a description of&nbsp;all the files that make up a theme. Sites as Themes To build a theme for Respond 6, simply build a site and then add a theme.json configuration file to tell the CMS what containers can be edited and what elements can be dragged. Theme Settings The settings.json file should be placed in the .private\/settings.json folder for your theme. [ { \"id\": \"editable\", \"value\": \"[role=\\\"main\\\"]\" }, { \"id\": \"sortable\", \"value\": \".col, .column\" } ] Setting Description editable A comma separated list of selectors to elements that are editable sortable A comma separated list of selectors to elements that are sortable. These should be a container of relative placed elements. Default Content Default content is the content added to a new page created within Respond. Default content should be placed in the .default.html file in the root of the theme. Theme Best Practices BASE element Respond adds all links and images relative to the root of the site. As a result, pages in the theme must specify a base element relative to the root. For instance, pages in a \/page\/ subdirectory must have a base of &lt;base href=\"..\/\"&gt;. Sortable ellements must be positioned static or relative. These elements cannot be floated. Immediate children of sortable containers (see settings) must be positioned relative or static. They cannot be floated or positioned absolute. However, children of those children do not have that restriction. Specify a [role=\"main\"] One element on the page should be given a role=\"main\" attribute. Respond uses this as the main content of the page. This main content is searchable and added to the pages.json file so that it can be made available to plugins. Installing a theme Simply place the theme folder in resources\/themes.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/creating-themes",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Install on Digital Ocean",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Install On Digital Ocean Support Respond! You can support the development of Respond 6 by using our Digital Ocean referral Code. This helps us pay for hosting. This tutorial will walk you step-by-step through installation on Digital Ocean. Create Digital Ocean Account 1. Start by creating your account on Digital Ocean. &nbsp;Use our referral code to support the project. 2. Key a hostname (e.g. respondcms.com), select a size for your installation, and select a region. 3. Select Applications -&gt; LAMP on Ubuntu 14.04. &nbsp;You could do this manually, but this speeds up the process. 4. Your will receive a password via email to SSH into your account. &nbsp;It is recommended you change this to an SSH key later. 5. You should now have a basic LAMP install, but it is good form to double check&nbsp;Digital Ocean's guide on setting up and securing the installation. Install mcrypt, git, curl php5enmod mcrypt apt-get install php5-curl apt-get install git service apache2 restart Setup App 1. Create directory structure, setup permissions for sites&nbsp; \/\/ change to html directory cd \/var\/www\/html \/\/ create Respond directory mkdir respond cd respond \/\/ create app and sites directory mkdir app \/\/ change to the app directory cd app 2. Clone the app repository into the app folder git clone https:\/\/github.com\/madoublet\/respond.git . 3. Create the sites directory in a subdirectory of the app directory. &nbsp;This will hold the sites created by Respond. \/\/ make sites directory in app (app\/sites) mkdir public\/sites \/\/ give respond permissions to write to sites chown -R www-data public\/sites chown -R www-data resources\/sites Enable Mod_Rewrite 1. Enable mod_rewrite extension sudo a2enmod rewrite 2. Open&nbsp;\/etc\/apache2\/apache2.conf via SSH or an editor using SFTP.&nbsp;Set AllowOverride to All. Options Indexes FollowSymLinks AllowOverride All Require all granted 3. Restart Apache (service apache2 restart) 4. Test API at&nbsp;&nbsp;http:\/\/your_ip\/respond\/app\/api\/site\/test. It should say \"API works!\". Setup your domains 1. Point a domain or subdomain to your installation directory. &nbsp;This is done in Apache 2.4 by creating a configuration file at etc\/apache2\/sites-available\/app.myrespond.com.conf. &lt;VirtualHost *:80> ServerAdmin admin@myrespond.com ServerName app.myrespond.com DocumentRoot \/var\/www\/html\/respond\/app\/ ErrorLog ${APACHE_LOG_DIR}\/error.log CustomLog ${APACHE_LOG_DIR}\/access.log combined &lt;\/VirtualHost> # vim: syntax=apache ts=4 sw=4 sts=4 sr noet You then enable the site using the command:&nbsp;a2ensite app.myrespond.com.conf&nbsp;and restarting Apache. You can find a lot more detail on the Digital Ocean site:&nbsp;How to Set Up Apache Virtual Hosts tutorial on Digital Ocean. Important: If you get the default Apache page after setting up and enabling your configuration, you might have to set the default server name to localhost. &nbsp;To do this, open etc\/apache2\/sites-available\/000-default.conf \/\/ change #ServerName www.example.com \/\/ to ServerName localhost 2. You can optionally&nbsp;setup wildcard subdomains or individual subdomains for the sites you create. &nbsp;Follow our tutorial on&nbsp;Setting up Wildcard subdomains&nbsp;to setup wildcard subdomains. Create your first site 1. If all goes well you should be able to create your first site at: &nbsp;http:\/\/your_url\/. &nbsp;You should see a carousel of themes if the API is working.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/install-on-digital-ocean",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Installing Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Installation Support Respond! You can support the development of Respond 6 by using our Digital Ocean referral Code. This helps us pay for hosting. Are you ready to get started with Respond? Learn how to install it on a traditional LAMP deployment. Read more about the server requirements. 1. Create the directory structure for Respond You create your directory structure by navigating to your web root and creating folders for Respond. \/\/ go to your HTML root cd var\/www\/html \/\/ create the respond directory mkdir respond \/\/ switch directories cd respond \/\/ create a directory to hold the app and sites mkdir app \/\/ change to the app directory cd app \/\/ make sites directory in app (app\/sites) mkdir public\/sites 2. Make the sites directory writeable This is typically done by making Apache the owner of the directory. You can also set permissions on the folder. Contact your hosting provider about the correct permissions for writeable directories. chown -R www-data public\/sites chown -R www-data resources\/sites 3. Pull Repository or Copy from ZIP Respond can be pulled from Github or installed from a ZIP file. The ZIP file should be extracted to your app directory created above. Git installation shown below. Note the trailing comma to copy the repository into the current directory. \/\/ switch to app directory cd app \/\/ clone Respond repository git clone https:\/\/github.com\/madoublet\/respond.git . 4. Setup env Copy the env file. You can set this up later to specify email and other settings. \/\/ switch to app directory cp .env.example .env 5. Map domains We recommend you setup a domain for your application and a sub-domain (or domain) for each of your sites. This allows you to secure your application using https and provide nice URLs for sites created using the CMS. Domains are typically setup using DNS and your htdocs file. Refer to your hosting provider's documentation on setting up domains. For installs that will host multiple sites, we have created a guide for installing wildcard DNS based on our Digital Ocean setup. ...\/respond ...\/respond\/app -> https:\/\/app.myrespond.com ...\/respond\/app\/public\/sites\/mysite -> https:\/\/mysite.myrespond.com or https:\/\/app.myrespond.com\/sites\/my-site",
        "keywords": "",
        "callout": "",
        "url": "documentation\/installation",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Server Requirements",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Recommended Server Requirements Respond requires a basic LAMP installation. &nbsp;The following are recommended requirements.&nbsp; Linux - tested on both Ubuntu and Amazon AMI Apache - 2.2 and 2.4 with mod_rewrite enabled MySQL PHP with extensions: mcrypt, gd, and curl GIT Composer",
        "keywords": "",
        "callout": "",
        "url": "documentation\/server-requirements",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Setting up Email",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Setting up Email Respond uses the PHPMailer project to send email within the system. So when a user signs up for a site, signs up for a subscription, or sends an email from a form on your site, it all goes through PHPMailer. Default Configuration By default, email is sent out via the default mail provider configured on your server. If you followed the Digital Ocean installation or use another VPS, you probably don't have one. Some shared servers offer this as an option. But, we think it is much better to outsource to a provider that specializes in this. Email from the app is always sent out to the primary email setup on the account. Custom Configuration To setup a custom email provider, Respond provides an SMTP configuration option. This is located in the .env file in the root. Variable Description EMAILS_FROM The from email address for emails sent by the app. EMAILS_FROM_NAME The from name for emails sent by the app. IS_SMTP Specifies whether the email is sent via SMTP. SMTP_HOST The SMTP Host for the server sending the emails SMTP_AUTH The SMTP Auth flag. SMTP_USERNAME The username to access the SMTP server. SMTP_PASSWORD The password to access the SMTP server. SMTP_SECURE The type of security used by the server. SMTPENC_KEY The penc key used by the server. Customizing Email Content You can easily customize the content in your emails by just editing an HTML file. The following emails are sent out from the Respond application: Email File Description Welcome Email resources\/emails\/new-user.html Sent out to the new user when a site is created. Reset Password resources\/emails\/reset-password.html Sent out when a user selects to reset a password.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/setting-up-email",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Creating themes",
        "description": "Learn how to create themes for Respond",
        "text": "Settings Theme settings enable you to allow global configurations across your site. They work great when you want to provide easy access for your users to change global design elements, such as logos, icons, or tile colors. A user can edit settings in the Settings UI of the Respond application. Creating a Setting Settings are stored on the theme under resources\/theme-name\/.private\/settings.json. They are copied to the site under resources\/sites\/site-name\/settings.json. Settings are stored in JSON in the following format. { \"id\": \"theme-logo\", \"label\": \"Logo\", \"description\": \"Primary logo of the site\", \"type\": \"image\", \"value\": \"files\\\/sample-logo.png\", \"sets\": \"attribute\", \"attribute\": \"src\" } Setting Description id The unique identifier for the setting. label The label shown in the settings UI. description The description shown in the settings UI. type The type of input shown in the settings UI (text or image are supported). value The default value of the setting. sets What is set by the setting (e.g. attribute) attribute The attribute that is set by the setting. Reference Settings in Code You reference a setting using the id of the setting as an attribute for the element. &lt;img theme-logo src=\"files\/persistence.png\"&gt;",
        "keywords": "",
        "callout": "",
        "url": "documentation\/settings",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Setup Reference",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Setup Respond This documentation covers the setup options available for you to configure the&nbsp;Respond&nbsp;application. Configurations are specified in the \/.env file of the application Basic Settings Variable Description APP_ENV The environment mode (development or production) that the app is running in. APP_KEY The unique key for the app. APP_URL The url to access the app. By default this is set to autodetect. FRIENDLY_URLS Set to true or false. Specifies whether the system should use friendly URLs (urls without .html). This requires an .htaccess or similar mechanism set on the site to enable friendly URLs. DEFAULT_LANGUAGE The default language for the app. DEFAULT_DIRECTION The default direction for the app. Email Settings Variable Description EMAILS_FROM The from email address for emails sent by the app. EMAILS_FROM_NAME The from name for emails sent by the app. IS_SMTP Specifies whether the email is sent via SMTP. SMTP_HOST The SMTP Host for the server sending the emails SMTP_AUTH The SMTP Auth flag. SMTP_USERNAME The username to access the SMTP server. SMTP_PASSWORD The password to access the SMTP server. SMTP_SECURE The type of security used by the server. SMTPENC_KEY The penc key used by the server. You can find more details on setting up email in the Setting up Email reference. App Settings Variable Description JWT_KEY The JavaScript Web Token key used to obfuscate tokens in Respond. PASSCODE The passcode used to create sites in the app. ALLOWED_FILETYPES Allowed filetypes that can be uploaded to your sites in Respond. THUMB_MAX_WIDTH The max width of thumbs created in Respond. THUMB_MAX_HEIGHT The max height of thumbs created in Respond.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/setup-reference",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Solutions to Common Problems",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Solutions to Common Problems This page contains a list of solutions to problems that come up when installing or using Respond. We will update this page based on community feedback.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/solutions",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Translating the Respond Application",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Translations Respond supports multiple languages for the application Translating the Respond Application Translating Respond into your preferred language is really easy. The basic process is duplicating a the existing English translation (stored in JSON format) and updating the name-value pairs with your language. 1. Create a new file in \/public\/i18n\/your-language-code.json Create a new file in \/locales\/ using the ISO639-1 code. For example, English would be \/locales\/en. 2. Copy the English translations Copy the translations from \/public\/i18\/en.json 3. Update the Name-Value pairs Update the name value pairs with the translation in your language. See the example below. { \"Account\": \"Cuenta\", \"account_created_click_login\": \"Cuenta creada! Para empezar haz click en el enlace de acceso.\", ... } 4. Add your language to \/public\/i18n\/languages.json Submitting a language to the open source project is a great way to contribute. The easiest way to add your language is to submit a pull request with your updates. If you are not familiar with GIT, then simply send your JSON file via email.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/translations",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Updating Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Updating Respond Updating Respond is easy. &nbsp;It typically involves pulling the latest version, re-publishing sites, and occasionally updating the database. &nbsp;Instructions are always available in the README.md for the release. 1. Pull the latest Version or re-upload the contents of the ZIP file \/\/ navigate to your install directory cd \/var\/www\/html\/respond\/app \/\/ pull the latest version git pull",
        "keywords": "",
        "callout": "",
        "url": "documentation\/updating-respond",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Wildcard Subdomains",
        "description": "Learn how to create themes for Respond",
        "text": "Wildcard Subdomain Installation The default installation method for&nbsp;Respond&nbsp;is AngularJS HTML5 mode. &nbsp;This works best for sites on a subdomain or root domain. &nbsp;This guide walks you through setting up&nbsp;wildcard subdomains so that you have your sites that you create automatically be mapped to a subdomain. 1. Enable vhost_alias module If you followed the Digital Ocean installation, you can do this via the following command. a2enmod vhost_alias service apache2 restart See this thread for additional options to enable this module:&nbsp;Invalid Command VirtualDocumentRoot 2. Set a subdomain to * This varies by DNS provider. &nbsp;But, typically you set the subdomain to * and URL Redirect it to a URL pointing at your server. &nbsp;If you use Namecheap, they provide a guide: &nbsp;How can I set up a catch-all (wildcard) subdomain? 3. Create a VirtualHost for your wildcard subdomains If you followed the&nbsp;Digital Ocean setup, you can create your VirtualHost using the following code. &nbsp;The exact virtualhost setup for our demo site is shown below. &lt;VirtualHost *:80> ServerName responddemo.website ServerAlias *.responddemo.website ServerAdmin matt@matthewsmith.com VirtualDocumentRoot \/var\/www\/html\/responddemo\/app\/sites\/%1\/ &lt;\/VirtualHost> # vim: syntax=apache ts=4 sw=4 sts=4 sr noet I use a standalone domain for this purpose. &nbsp;I have found that trying to use the same domain as your app (or other subdomains) causes issues.",
        "keywords": "",
        "callout": "",
        "url": "documentation\/wildcard-subdomain-install",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Learn how to use Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Download Thank you for supporting the Respond project! If you qualify for a perk, then we will email you within 48 hours. ZIP File Respond ZIP file Github Access Respond Github Thanks again, Matt",
        "keywords": "",
        "callout": "",
        "url": "download-now",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Download",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Download Over 500 hours went into the design and construction of Respond 6. We think you will love it. Everything is licensed under the MIT license, so you are free to use it for commercial use. However, we encourage you to pay what you think the product is worth. We offer some great perks in exchange. Pay what you want $ One time Per month Pay and Download Skip and download Respond now Payments are processed by PayPal Perks Perks are our way of saying thank you by giving you something in return for contributing to a great open source project. Perks will be emailed to you. Please allow up to 48 hours. $25 one time or $5\/month 3 Themes &mdash; With this perk you get the Persistence, Perspective and Executive themes&mdash;a $45 value. $50 one time or $15\/month 8 Themes &mdash; With this perk you get 8 themes&mdash;a $75 value (themes available after beta launch). $100 one time or $25\/month All Themes + Recognition &mdash; With this perk you get a 15 themes&mdash;a $150 value (themes available after beta launch). Your name and website will be added to the Contributors page. $50\/month All themes + Private access &mdash; With this perk you get private access to our premium themes repository. This gives you instant access to updates and new themes. Your name and website will be added to the top of the Contributors page. $100\/month 10 available All themes + Private access + Sponsorship &mdash; With this perk you get private access to our premium themes repository. This gives you instant access to updates and new themes. Your name and website will be added to the top of the Contributors page. Your site logo and link will be added to the right panel of the learn and about pages. $250\/month 1 available All themes + Private access + Primary Sponsorship &mdash; With this perk you get private access to our premium themes repository. This gives you instant access to updates and new themes. Your name and website will be added to the top of the Contributors page. Your site logo and link will be added to the home page and right panel of the learn and about pages.",
        "keywords": "",
        "callout": "",
        "url": "download",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-25T11:10:15.0Z"
    },
    {
        "title": "Respond - Bootstrap CMS",
        "description": "Learn how to create themes for Respond",
        "text": "100% Bootstrap While it might not look like a traditional Bootstrap site, the app and editor are built using a customized version of the framework. &nbsp;So, if you are looking to extend the CMS or build on top of it, you can be assured that you will see a lot of familiar code that is tested and responsive. The default theme and all themes that are sold on the marketplace are built on Bootstrap as well. &nbsp;So, while most of the themes don't look like the default Bootstrap look and feel, you can be assured that they are just customized versions of the framework.",
        "keywords": "",
        "callout": "",
        "url": "feature\/bootstrap-cms",
        "photo": "resources\/tools.png",
        "thumb": "resources\/tools.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Feature: Editor",
        "description": "Learn how to create themes for Respond",
        "text": "Editor Respond features a one-of-a-kind editor that supports multi-column layouts, contextual semantic HTML elements, and drag-and-drop reordering of elements. We think it is the best CMS editor on the planet. Let us show you why. Multi-Column Layouts Respond allows you to create multi-column layouts within the editor. &nbsp;Create one, two, three, and four column layouts with ease using Bootstrap's responsive grid. Contextual Menus Respond features a powerful contextual menu (on the right) that updates as you focus on a widget. &nbsp;This makes it easier than ever to quickly adjust text and settings for Respond's rich widgets. And, much more... Respond's editor features many more features that you have come to expect in a great CMS: 25+ semantic elements and rich widgets Drag-and-Drop support Font awesome icons Bold, italicize, strike, underline, link and modify your text with ease Full control of IDs and CSS classes Embed Google maps Responsive video embeds Responsive shelf and shopping cart support Pre-formatted (or code) text support Create lists of content, embed complete pages into your content, and even embed menus",
        "keywords": "",
        "callout": "",
        "url": "feature\/editor",
        "photo": "http:\/\/respondcms.com\/files\/columns.png",
        "thumb": "http:\/\/respondcms.com\/files\/columns.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Learn how to use Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Get Started Get started building your site with Respond. &nbsp;Respond&nbsp;is a 100% open source project. &nbsp;So, if you are a developer, you can setup a complete&nbsp;Respond&nbsp;install on your server.&nbsp;&nbsp;Not a developer? &nbsp;Contact us&nbsp;about hosting your site on Respond's server. &nbsp; Get started on our Learn page",
        "keywords": "",
        "callout": "",
        "url": "get-started",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Help",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Help Having problems using or installing Respond? &nbsp;Try our community support. Respond Forum&nbsp; (Old Google Groups forum:&nbsp;Google Groups Forum) Google+ Community Ask a question on Stack Overflow Need an expert solution? Need expert support and installation? &nbsp;We offer a number of services to make your life easier. &nbsp;Check out our paid services",
        "keywords": "",
        "callout": "",
        "url": "help",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Build fast, responsive sites with Respond CMS",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Introducing Respond 6 Respond 6 is a fresh start for our CMS introducing a flat-file (no database) approach to data storage; best-of-class front-end and backend frameworks to power the app; a beautiful, custom visual editor; and easy-to-write plugins and themes. These tools power the fast, static HTML sites produced by the CMS. Powered by a Modern Technology Stack Lumen PHP Lumen is an elegant, well-documented, and easy-to-use backend framework that enables you to quickly extend Respond 6 to meet the needs of your application. Angular 2 Angular 2 is the new fast, component-based framework built by Google that enables you to quickly add new experiences to your Respond-powered application. Static HTML By deploying your content to a static site, Respond makes backups easy and allows you to save money by enabling deployment to static hosting services. Easy-to-Use Visual Editor Respond 6 features a beautiful, easy-to-use visual editor that allows you to edit content right on the page. Built for Developers Simple Plugins With Respond 6, Respond plugins are as simple as writing a small line of HTML to specify what is output to the screen. More advanced plugins can easily be made using a bit of JavaScript. Sites as Themes Tired of learning a new framework just to create a theme? With Respond 6, your site is your theme. Just add a few attributes and a configuration file and you are ready to go. Affordable Store Individual themes are just $15 or a 5 pack for $50. These themes can be re-used as many times as you like. And, they are easily configurable to meet your target audience. Beautiful Themes Respond 6 comes with 3 starter themes that give you a great starting point for your Bootstrap 4, Foundation, or MDL project. Ready-to-go themes are available for just $25 each.",
        "keywords": "",
        "callout": "",
        "url": "index",
        "photo": "resources\/bulb.png",
        "thumb": "resources\/bulb.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Documentation",
        "description": "Learn how to create themes for Respond",
        "text": "Learn Our documentation walks you through installing, configuring and extending Respond. Installing and Updating Respond Tutorial Description Installation Learn how to install&nbsp;Respond&nbsp;on your own server. Digital Ocean Installation Step-by-Step instructions to install Respond on Digital Ocean. Wildcard Subdomain Installation&nbsp; Learn how to setup wildcard subdomains to host multiple sites on Respond. Server Requirements Learn more about the server requirements for Respond 4. Updating Respond Learn how to update Respond when a new version is released. Key Concepts Tutorial Description Creating Themes A reference for creating Themes with&nbsp;Respond. Creating Plugins A reference for creating Plugins with Respond. Theme Settings A reference for creating settings with Respond. Configuring and Using Respond Tutorial Description Setup Reference A reference to configuration options available .env. Setting up Email Learn how to setup and customize emails in Respond. Translating Respond A reference on translating the app using simple JSON files. Troubleshooting Tutorial Description Solutions to Common Problems This guide walks you through solutions to common problems encountered when setting up&nbsp;Respond.",
        "keywords": "",
        "callout": "",
        "url": "learn",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Build fast, responsive sites with Respond CMS",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Store Opening during the beta. Individual themes will be priced at $15. You can also get a 5 pack for $50.",
        "keywords": "",
        "callout": "",
        "url": "marketplace",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - About",
        "description": "Learn how to create themes for Respond",
        "text": "About Our Mission Our mission is to empower freelance designers and developers by providing them with a beautiful Content Management System that is as easy-to-use as it is powerful. Our Team Respond&nbsp;is designed and built by&nbsp;Matthew Smith&nbsp;with the help of&nbsp;many others.&nbsp; I created&nbsp;Respond&nbsp;because after years of writing PHP and Knockout, I fell in love with the simplicity and power of AngularJS. &nbsp;I thought it&nbsp;was the perfect medium to build fast, modern and responsive sites. &nbsp;So, I took the foundation of Respond 1-3 and used it to implement a CMS using AngularJS. &nbsp;The result of this effort is Respond 4.&nbsp; Contact: &nbsp;matt@matthewsmith.com Twitter:&nbsp;@matthewsmith,&nbsp;@respondcms",
        "keywords": "",
        "callout": "",
        "url": "page\/about",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Acknowledgments",
        "description": "Learn how to create themes for Respond",
        "text": "Acknowledgements This is just a quick shout out to all the great open source projects that are used to make Respond great. Font Awesome&nbsp;- A lot of the icons used within the editor come from Font Awesome. &nbsp;This project continues to make the lives of developers easier. Magnific Popup&nbsp;- Magnific powers the lightbox feature of Respond. AngularJS&nbsp;- The fantastic front-end framework that powers the app and sites in Respond. Bootstrap&nbsp;- Powers the layout and style of the apps and sites. Unsplash&nbsp;- The ultra cool resource for beautiful, free stock photos. &nbsp;They make our themes look great. LessPHP&nbsp;- The library that powers our LESS to CSS conversions. TonicPHP&nbsp;- The framework that powers our REST API. Guzzle&nbsp;- Guzzle provides the backend for our Amazon implementation, as well as, the framework for our webhooks implementation. PHPMailer&nbsp;- Provides the underlying framework for emails sent in the system. Composer&nbsp;- Handles dependency management within the application. Firebase PHP-JWT&nbsp;- Provides our web token authentication implementation. jQuery&nbsp;- Used to simplify some of our scripting. i18next&nbsp;- Used for internationalizing the app and the sites. ng-i18next&nbsp;- Integrates the i18next JS framework with AngularJS CodeMirror&nbsp;- Used for editing HTML and CSS within the application. MomentJS&nbsp;- Handles time within the application A big thank you to all those who build these great projects.",
        "keywords": "",
        "callout": "",
        "url": "page\/acknowledgements",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Contact",
        "description": "Learn how to create themes for Respond",
        "text": "Contact Us Got a question about Respond? &nbsp;Reach out to me at&nbsp;matt@matthewsmith.com",
        "keywords": "",
        "callout": "",
        "url": "page\/contact",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Documentation",
        "description": "Learn how to create themes for Respond",
        "text": "Learn Our documentation walks you through installing, configuring and extending Respond. Installing and Updating Respond Tutorial Description Installation Learn how to install&nbsp;Respond&nbsp;on your own server. Digital Ocean Installation Step-by-Step instructions to install Respond on Digital Ocean. Wildcard Subdomain Installation&nbsp; Learn how to setup wildcard subdomains to host multiple sites on Respond. Server Requirements Learn more about the server requirements for Respond 4. Install from ZIP Learn how to install Respond using a ZIP file. Updating Respond Learn how to update Respond when a new version is released. Key Concepts Tutorial Description Themes A reference for creating Themes with&nbsp;Respond. Plugins A reference for creating Plugins with Respond. Configuring and Using Respond Tutorial Description Setup Reference A reference to configuration options available .env. Managing Multiple Sites Learn how to manage multiple sites in Respond. Setting up Email Learn how to setup and customize emails in Respond. Translating Respond A reference on translating the app using simple JSON files. Troubleshooting Tutorial Description Solutions to Common Problems This guide walks you through solutions to common problems encountered when setting up&nbsp;Respond.",
        "keywords": "",
        "callout": "",
        "url": "page\/documentation",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Error",
        "description": "Learn how to create themes for Respond",
        "text": "Page Not Found We were unable to find the page you requested.",
        "keywords": "",
        "callout": "",
        "url": "page\/error",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - License",
        "description": "Learn how to create themes for Respond",
        "text": "License The software is provided free for both commercial and non-commercial uses. The software is licensed under the MIT license. Attribution Required We have put a lot of effort into the creation of this software. The only thing we ask in return is that you do not claim it as your own. This does not mean we do not want you to create your own copy of the software. In fact, that is exactly what we hope you do. What it does mean, is that when you do create your own copy, you should provide attribution to respondcms.com. This should be publicly visible and not obscured in any way. Questions Feel free to reach out to us if you have any questions about our license. Contact Us",
        "keywords": "",
        "callout": "",
        "url": "page\/license",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Pricing",
        "description": "Learn how to create themes for Respond",
        "text": "Pricing TBD 100% open source, always. Built by Matthew Smith in Manchester, MO. Respond 6 is an open source, responsive content management system built on the Lumen PHP and Angular 2 frameworks. Respond 6 is built so that you can quickly build beautiful, responsive websites. The latest version features flat-file storage, a beautiful visual editor, and fast static sites. HomeBlogAboutContact",
        "keywords": "",
        "callout": "",
        "url": "page\/pricing",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Privacy Policy",
        "description": "Learn how to create themes for Respond",
        "text": "Privacy Policy Your privacy is important to us. Here are a few of our core principles: We don't ask for information unless we need it We don't require any information to create a site, you enter as much or as little as you are comfortable with We only store what you enter on the server We use strong cryptography to store your password and do not store identifiable information in cookies\/session We use Stripe to process Credit Cards. We do not store your Credit Card Information. Website Visitors Like most website operators, Respond collects non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. Responds purpose in collecting non-personally identifying information is to better understand how Responds visitors use its website. From time to time, Respond may release non-personally-identifying information in the aggregate, e.g., by publishing a report on trends in the usage of its website. Respond also collects potentially personally-identifying information like Internet Protocol (IP) addresses for logged in users. Respond only discloses logged in user addresses under the same circumstances that it uses and discloses personally-identifying information as described below. Gathering of Personally-Identifying Information Certain visitors to Responds websites choose to interact with Respond in ways that require Respond to gather personally-identifying information. The amount and type of information that Respond gathers depends on the nature of the interaction. For example, Respond users who sign up for our service enter their email, name, password, and property information. We only require email, name, password, and address to create an account. All other information is supplied at the discretion of the user. Respond does not disclose personally-identifying information other than as described below. And visitors can always refuse to supply personally-identifying information, with the caveat that it may prevent them from engaging in certain website-related activities. Aggregated Statistics Respond may collect statistics about the behavior of visitors to its websites. For instance, Respond may monitor listings on the site. Respond may display this information publicly or provide it to others. However, Respond does not disclose personally-identifying information other than as described below. Protection of Certain Personally-Identifying Information Respond discloses potentially personally-identifying and personally-identifying information only to those of its employees, contractors and affiliated organizations that (i) need to know that information in order to process it on Responds behalf or to provide services available at Responds websites, and (ii) that have agreed not to disclose it to others. Some of those employees, contractors and affiliated organizations may be located outside of your home country; by using Responds websites, you consent to the transfer of such information to them. Respond will not rent or sell potentially personally-identifying and personally-identifying information to anyone. Other than to its employees, contractors and affiliated organizations, as described above, Respond discloses potentially personally-identifying and personally-identifying information only in response to a subpoena, court order or other governmental request, or when Respond believes in good faith that disclosure is reasonably necessary to protect the property or rights of Respond, third parties or the public at large. If you are a registered user of an Respond website and have supplied your email address, Respond may occasionally send you an email to tell you about new features, solicit your feedback, or just keep you up to date with whats going on with Respond and our products. We primarily use our various product blogs to communicate this type of information, so we expect to keep this type of email to a minimum. If you send us a request (for example via a support email or via one of our feedback mechanisms), we reserve the right to publish it in order to help us clarify or respond to your request or to help us support other users. Respond takes all measures reasonably necessary to protect against the unauthorized access, use, alteration or destruction of potentially personally-identifying and personally-identifying information. Sessions A session is a string of information that a website stores on a visitors computer, and that the visitors browser provides to the website each time the visitor returns. Respond uses sessions to help Respond identify and track visitors, their usage of Respond website, and their website access preferences. Respond visitors who do not wish to have sessions placed on their computers should set their browsers to refuse sessions before using Responds websites, with the drawback that certain features of Responds websites may not function properly without the aid of cookies. Business Transfers If Respond, or substantially all of its assets, were acquired, or in the unlikely event that Respond goes out of business or enters bankruptcy, user information would be one of the assets that is transferred or acquired by a third party. You acknowledge that such transfers may occur, and that any acquirer of Respond may continue to use your personal information as set forth in this policy. Ads Ads appearing on any of our websites may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by Respond and does not cover the use of cookies by any advertisers. Privacy Policy Changes Although most changes are likely to be minor, Respond may change its Privacy Policy from time to time, and in Responds sole discretion. Respond encourages visitors to frequently check this page for any changes to its Privacy Policy. Your continued use of this site after any change in this Privacy Policy will constitute your acceptance of such change.",
        "keywords": "",
        "callout": "",
        "url": "page\/privacy-policy",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Technology",
        "description": "Learn how to create themes for Respond",
        "text": "Respond Technology Respond is powered by Angular 2 and the Lumen PHP framework. Sites produced by the CMS are static HTML.",
        "keywords": "",
        "callout": "",
        "url": "page\/technology",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Terms of Service",
        "description": "Learn how to create themes for Respond",
        "text": "Terms of Service The following terms and conditions govern all use of the Respond website and all content, services and products available at or through the website. The Website is owned and operated by Matthew Smith, LLC. The Website is offered subject to your acceptance without modification of all of the terms and conditions contained herein and all other operating rules, policies (including, without limitation, Respond's Privacy Policy) and procedures that may be published from time to time on this Site by Respond (collectively, the Agreement). Please read this Agreement carefully before accessing or using the Website. By accessing or using any part of the web site, you agree to become bound by the terms and conditions of this agreement. If you do not agree to all the terms and conditions of this agreement, then you may not access the Website or use any services. If these terms and conditions are considered an offer by Respond, acceptance is expressly limited to these terms. The Website is available only to individuals who are at least 13 years old. Your Respond Site and Account If you create a site, you are responsible for maintaining the security of your site, and you are fully responsible for all activities that occur under the account and any other actions taken in connection with the site. You must not describe or assign keywords to your site in a misleading or unlawful manner, including in a manner intended to trade on the name or reputation of others, and Respond may change or remove any description or keyword that it considers inappropriate or unlawful, or otherwise likely to cause Respond liability. You must immediately notify Respond of any unauthorized uses of your blog, your account or any other breaches of security. Respond will not be liable for any acts or omissions by You, including any damages of any kind incurred as a result of such acts or omissions. Responsibility of Contributors If you operate a site, post material to the Website, post links on the Website, or otherwise make (or allow any third party to make) material available by means of the Website (any such material, Content), You are entirely responsible for the content of, and any harm resulting from, that Content. That is the case regardless of whether the Content in question constitutes text, graphics, an audio file, or computer software. By making Content available, you represent and warrant that: the downloading, copying and use of the Content will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark or trade secret rights, of any third party; if your employer has rights to intellectual property you create, you have either (i) received permission from your employer to post or make available the Content, including but not limited to any software, or (ii) secured from your employer a waiver as to all rights in or to the Content; you have fully complied with any third-party licenses relating to the Content, and have done all things necessary to successfully pass through to end users any required terms; the Content does not contain or install any viruses, worms, malware, Trojan horses or other harmful or destructive content; the Content is not spam, is not machine- or randomly-generated, and does not contain unethical or unwanted commercial content designed to drive traffic to third party sites or boost the search engine rankings of third party sites, or to further unlawful acts (such as phishing) or mislead recipients as to the source of the material (such as spoofing); the Content is not pornographic, does not contain threats or incite violence, and does not violate the privacy or publicity rights of any third party; your site is not getting advertised via unwanted electronic messages such as spam links on newsgroups, email lists, other blogs and web sites, and similar unsolicited promotional methods; your site is not named in a manner that misleads your readers into thinking that you are another person or company. For example, your blogs URL or name is not the name of a person other than yourself or company other than your own; and you have, in the case of Content that includes computer code, accurately categorized and\/or described the type, nature, uses and effects of the materials, whether requested to do so by Respond or otherwise. By submitting Content to Respond for inclusion on your Website, you grant Respond a world-wide, royalty-free, and non-exclusive license to reproduce, modify, adapt and publish the Content solely for the purpose of displaying, distributing and promoting your blog. If you delete Content, Respond will use reasonable efforts to remove it from the Website, but you acknowledge that caching or references to the Content may not be made immediately unavailable. Without limiting any of those representations or warranties, Respond has the right (though not the obligation) to, in Respond sole discretion (i) refuse or remove any content that, in Respond's reasonable opinion, violates any Respond policy or is in any way harmful or objectionable, or (ii) terminate or deny access to and use of the Website to any individual or entity for any reason, in Respond sole discretion. Respond will have no obligation to provide a refund of any amounts previously paid. Payment and Renewal Respond is a paid service. By creating a site, you agree to pay Respond the fees indicated for that service. Payments will be charged on a pre-pay basis on the day you sign up and will cover the use of that service for the period as indicated. Fees are not refundable. Automatic Renewal Unless you notify Respond before the end of the applicable subscription period that you want to cancel your subscription, your subscription will automatically renew and you authorize us to collect the then-applicable annual or monthly subscription fee (as well as any taxes) using any credit card or other payment mechanism we have on record for you. Subscriptions can be canceled at any time in the Account section of your dashboard. Responsibility of Website Visitors Respond has not reviewed, and cannot review, all of the material, including computer software, posted to the Website, and cannot therefore be responsible for that materials content, use or effects. By operating the Website, Respond does not represent or imply that it endorses the material there posted, or that it believes such material to be accurate, useful or non-harmful. You are responsible for taking precautions as necessary to protect yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive content. The Website may contain content that is offensive, indecent, or otherwise objectionable, as well as content containing technical inaccuracies, typographical mistakes, and other errors. The Website may also contain material that violates the privacy or publicity rights, or infringes the intellectual property and other proprietary rights, of third parties, or the downloading, copying or use of which is subject to additional terms and conditions, stated or unstated. Respond disclaims any responsibility for any harm resulting from the use by visitors of the Website, or from any downloading by those visitors of content there posted.Content Posted on Other Websites. We have not reviewed, and cannot review, all of the material, including computer software, made available through the websites and webpages to which Respond links, and that link to Respond. Respond does not have any control over those non-Respond websites and webpages, and is not responsible for their contents or their use. By linking to a non-Respond website or webpage, Respond does not represent or imply that it endorses such website or webpage. You are responsible for taking precautions as necessary to protect yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive content. Respond disclaims any responsibility for any harm resulting from your use of non-Respond websites and webpages. Copyright Infringement and DMCA Policy 'sAs Respond asks others to respect its intellectual property rights, it respects the intellectual property rights of others. If you believe that material located on or linked to by Respond.com violates your copyright, you are encouraged to notify Respond in accordance with Responds Digital Millennium Copyright Act (DMCA) Policy. Respond will respond to all such notices, including as required or appropriate by removing the infringing material or disabling all links to the infringing material. Respond will terminate a visitors access to and use of the Website if, under appropriate circumstances, the visitor is determined to be a repeat infringer of the copyrights or other intellectual property rights of Respond or others. In the case of such termination, Respond will have no obligation to provide a refund of any amounts previously paid to Respond.Intellectual Property. This Agreement does not transfer from Respond to you any Respond or third party intellectual property, and all right, title and interest in and to such property will remain (as between the parties) solely with Respond. Respond, Respond, Respond.com, the Respond.com logo, and all other trademarks, service marks, graphics and logos used in connection with Respond.io, or the Website are trademarks or registered trademarks of Respond or Respond licensors. Other trademarks, service marks, graphics and logos used in connection with the Website may be the trademarks of other third parties. Your use of the Website grants you no right or license to reproduce or otherwise use any Respond or third-party trademarks. Termination Respond may terminate your access to all or any part of the Website at any time, with or without cause, with or without notice, effective immediately. If you wish to terminate this Agreement or your respondcms.com account (if you have one), you may simply discontinue using the Website. All provisions of this Agreement which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability. Disclaimer of Warranties The Website is provided as is. Respond and its suppliers and licensors hereby disclaim all warranties of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose and non-infringement. Neither Respond nor its suppliers and licensors, makes any warranty that the Website will be error free or that access thereto will be continuous or uninterrupted. If youre actually reading this, heres a treat. You understand that you download from, or otherwise obtain content or services through, the Website at your own discretion and risk.Limitation of Liability. In no event will Respond, or its suppliers or licensors, be liable with respect to any subject matter of this agreement under any contract, negligence, strict liability or other legal or equitable theory for: (i) any special, incidental or consequential damages; (ii) the cost of procurement for substitute products or services; (iii) for interruption of use or loss or corruption of data; or (iv) for any amounts that exceed the fees paid by you to Respond under this agreement during the twelve (12) month period prior to the cause of action. Respond shall have no liability for any failure or delay due to matters beyond their reasonable control. The foregoing shall not apply to the extent prohibited by applicable law. General Restrictions and Warranties You represent and warrant that (i) your use of the Website will be in strict accordance with the Respond Privacy Policy, with this Agreement and with all applicable laws and regulations (including without limitation any local laws or regulations in your country, state, city, or other governmental area, regarding online conduct and acceptable content, and including all applicable laws regarding the transmission of technical data exported from the United States or the country in which you reside) and (ii) your use of the Website will not infringe or misappropriate the intellectual property rights of any third party. Indemnification You agree to indemnify and hold harmless Respond, its contractors, and its licensors, and their respective directors, officers, employees and agents from and against any and all claims and expenses, including attorneys fees, arising out of your use of the Website, including but not limited to your violation of this Agreement. Miscellaneous This Agreement constitutes the entire agreement between Respond and you concerning the subject matter hereof, and they may only be modified by a written amendment signed by an authorized executive of Respond, or by the posting by Respond of a revised version. Except to the extent applicable law, if any, provides otherwise, this Agreement, any access to or use of the Website will be governed by the laws of the state of Missouri, U.S.A., excluding its conflict of law provisions, and the proper venue for any disputes arising out of or relating to any of the same will be the state and federal courts located in St. Louis County, Missouri. Except for claims for injunctive or equitable relief or claims regarding intellectual property rights (which may be brought in any competent court without the posting of a bond), any dispute arising under this Agreement shall be finally settled in accordance with the Comprehensive Arbitration Rules of the Judicial Arbitration and Mediation Service, Inc. (JAMS) by three arbitrators appointed in accordance with such Rules. The arbitration shall take place in St. Louis, Missouri, in the English language and the arbitral decision may be enforced in any court. The prevailing party in any action or proceeding to enforce this Agreement shall be entitled to costs and attorneys fees. If any part of this Agreement is held invalid or unenforceable, that part will be construed to reflect the parties original intent, and the remaining portions will remain in full force and effect. A waiver by either party of any term or condition of this Agreement or any breach thereof, in any one instance, will not waive such term or condition or any subsequent breach thereof. You may assign your rights under this Agreement to any party that consents to, and agrees to be bound by, its terms and conditions; Respond may assign its rights under this Agreement without condition. This Agreement will be binding upon and will inure to the benefit of the parties, their successors and permitted assigns.",
        "keywords": "",
        "callout": "",
        "url": "page\/terms-of-service",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Pro",
        "description": "Learn how to create themes for Respond",
        "text": "Respond PRO Package TBD",
        "keywords": "",
        "callout": "",
        "url": "page\/test",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Themes",
        "description": "Learn how to create themes for Respond",
        "text": "Themes Respond themes updated for R6.",
        "keywords": "",
        "callout": "",
        "url": "page\/themes",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Learn how to use Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Tour Take a quick tour to see why we think Respond is the best way to create modern, responsive websites. A Beautiful UI Respond features a beautiful, app inspired UI that puts the focus where it should be - on your content. Images are pulled forward from the page to ease discovery and draw you into the app. A Superior Editing Experience The editor provides you with a rich environment to build your pages. All your options are presented contextually to the right of the content to speed page creation. With drag-and-drop widgets and multi-column layouts, you can create beautiful and unique pages without writing code. Learn more about our editor. Powerful Tools Respond provides you all the tools you need to build your website. From themes to branding to even code, Respond gives you full access to your site. It is easy-to-use when you need it to be and powerful when it has to be.",
        "keywords": "",
        "callout": "",
        "url": "page\/tour",
        "photo": "resources\/screen.png",
        "thumb": "resources\/screen.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Build fast, responsive sites with Respond CMS",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Services Hosting Respond offers developer friendly site hosting solutions for any size website. &nbsp;Contact Us&nbsp;to get started. Plan Pricing Shared hosting $25 \/month Dedicated $25 \/month + Digital Ocean fees&nbsp; Paid Installation, Training and Support Need expert support and installation? &nbsp;We offer a number of services to make your job easier. &nbsp;Contact us&nbsp;to get started. Service Pricing Digital Ocean Installation $100 Digital Ocean Installation with SSL $125 Convert your Design to a Respond 6 Theme $300 Paid Support and\/or Training $75 \/hour Custom Development $75 \/hour",
        "keywords": "",
        "callout": "",
        "url": "services",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "",
        "description": "",
        "text": "Services Hosting Respond offers developer friendly site hosting solutions for any size website. &nbsp;Contact Us&nbsp;to get started. Plan Pricing Shared hosting $25 \/month Dedicated $25 \/month + Digital Ocean fees&nbsp; Paid Installation, Training and Support Need expert support and installation? &nbsp;We offer a number of services to make your job easier. &nbsp;Contact us&nbsp;to get started. Service Pricing Digital Ocean Installation $100 Digital Ocean Installation with SSL $125 Convert your Design to a Respond 6 Theme $300 Paid Support and\/or Training $75 \/hour Custom Development $75 \/hour",
        "keywords": "",
        "callout": "",
        "url": "snippets\/components",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "",
        "description": "",
        "text": "Services Hosting Respond offers developer friendly site hosting solutions for any size website. &nbsp;Contact Us&nbsp;to get started. Plan Pricing Shared hosting $25 \/month Dedicated $25 \/month + Digital Ocean fees&nbsp; Paid Installation, Training and Support Need expert support and installation? &nbsp;We offer a number of services to make your job easier. &nbsp;Contact us&nbsp;to get started. Service Pricing Digital Ocean Installation $100 Digital Ocean Installation with SSL $125 Convert your Design to a Respond 6 Theme $300 Paid Support and\/or Training $75 \/hour Custom Development $75 \/hour",
        "keywords": "",
        "callout": "",
        "url": "snippets\/footer",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Learn how to use Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Support Reach out at matt@matthewsmith.com or fill out the form below.",
        "keywords": "",
        "callout": "",
        "url": "support",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Chromatic",
        "description": "The Chromatic theme is used by Triangulate.io to provide an elegant introduction to the application.",
        "text": "ChromaticOwn the theme that powers respondcms.com. &nbsp;Chromatic features a bold color, a strong call-to-action and a prominent image that focuses attention on your product. &nbsp;With over 50 configurations, you can quickly make this theme your own.Theme DemoUnlimited SitesFREEThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/chromatic",
        "photo": "http:\/\/respondcms.com\/files\/chromatic.png",
        "thumb": "http:\/\/respondcms.com\/files\/chromatic.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Energy",
        "description": "The Energy theme is a small-business ready theme that combines a beautiful call-to-action next to a slideshow to showcase your business.",
        "text": "EnergyThe Energy theme is a small-business ready theme that combines a beautiful call-to-action next to a slideshow to showcase your business.Theme DemoUnlimited SitesFree",
        "keywords": "",
        "callout": "",
        "url": "theme\/energy",
        "photo": "http:\/\/respondcms.com\/files\/energy.png",
        "thumb": "http:\/\/respondcms.com\/files\/energy.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Executive",
        "description": "",
        "text": "ExecutiveThe Executive theme from Respond provides your business or personal site with a professional, timeless feel. &nbsp;And, the built-in parallax callout on the home screen gives your site a little unexpected whimsy.&nbsp;With over 50 point-and-click configurations built-in to the the theme, you can quickly make the Executive theme your own without ever touching any code.Theme DemoUnlimited SitesFREEThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/executive",
        "photo": "http:\/\/respondcms.com\/files\/executive.png",
        "thumb": "http:\/\/respondcms.com\/files\/executive.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Geometric",
        "description": "The Geometric theme focuses on a geometric background and a simple white header with callouts to social icons.",
        "text": "GeometricThe Geometric theme uses a simple geometric pattern to focus attention on your brand's message. &nbsp;Strong callouts reinforce your message and act as a call-to-action. &nbsp;With 50+ configurations available, it can be quickly setup to match your brand's style.Theme DemoUnlimited SitesFREEThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/geometric",
        "photo": "http:\/\/respondcms.com\/files\/geometric.png",
        "thumb": "http:\/\/respondcms.com\/files\/geometric.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Getaway",
        "description": "Getaway is a brand new theme for Respond 4.6 that features a full-width slideshow on the home screen.",
        "text": "GetawayGetaway is beautiful theme built around the notion of a resort website. &nbsp;It features an easy-to-use full width slideshow on the home screen that can be configured with new images, titles, and buttons right from within the editor. &nbsp;Getaway features 25+ configurations so that you can quickly make it your own.Theme DemoUnlimited SitesFreeThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/getaway",
        "photo": "http:\/\/respondcms.com\/files\/getaway.png",
        "thumb": "http:\/\/respondcms.com\/files\/getaway.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Notion",
        "description": "Notion is a premium theme from Respond featuring unique off-canvas navigation and an emphasis on beautiful photography.",
        "text": "NotionThe Notion theme from Respond showcases a unique off-canvas menu with a focus on beautiful photography. &nbsp;The primary menu slides into the page, while the large primary image focuses the viewer on your message. With 50+ configurations (including the main image), you can quickly shape notion to match your brand.Theme DemoUnlimited SitesFREEThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/notion",
        "photo": "http:\/\/respondcms.com\/files\/notion.png",
        "thumb": "http:\/\/respondcms.com\/files\/notion.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Persistence",
        "description": "Persistence is a beautiful theme that features bold text set against a beautiful background. The built-in parallax callout on the home screen gives your site a little unexpected whimsy. With over 50 point-and-click configurations built-in to the the theme, you can quickly make the Persistence theme your own without ever touching any code.",
        "text": "PersistencePersistence is a beautiful theme that features bold text set against a beautiful background. The built-in parallax callout on the home screen gives your site a little unexpected whimsy. With over 50 point-and-click configurations built-in to the the theme, you can quickly make the Persistence theme your own without ever touching any code..Theme DemoUnlimited SitesFreeThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/persistence",
        "photo": "http:\/\/respondcms.com\/files\/persistence.png",
        "thumb": "http:\/\/respondcms.com\/files\/persistence.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Perspective",
        "description": "Perspective is a beautiful theme that features bold text set against a beautiful background. The built-in parallax callout on the home screen gives your site a little unexpected whimsy. With over 50 point-and-click configurations built-in to the the theme, you can quickly make the Persistence theme your own without ever touching any code..",
        "text": "PerspectivePerspective is a beautiful theme that features bold text set against a beautiful background. The built-in parallax callout on the home screen gives your site a little unexpected whimsy. With over 50 point-and-click configurations built-in to the the theme, you can quickly make the Persistence theme your own without ever touching any code..Theme DemoUnlimited SitesFreeThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/perspective",
        "photo": "http:\/\/respondcms.com\/files\/perspective.png",
        "thumb": "http:\/\/respondcms.com\/files\/perspective.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Serene",
        "description": "Serene is a premium theme featuring beautiful imagery and clean typography.",
        "text": "SereneSerene is a premium theme featuring beautiful imagery and simple typography. &nbsp;With 50+ configurations (including the main image), you can quickly shape notion to match your brand.Theme DemoUnlimited SitesFreePurchases and downloads facilitated by&nbsp;Sellfy. &nbsp;Pay with either Paypal or Credit Card. &nbsp;Unlimited license is&nbsp;limited to a single&nbsp;Respond&nbsp;installation.",
        "keywords": "",
        "callout": "",
        "url": "theme\/serene",
        "photo": "http:\/\/respondcms.com\/files\/serene.png",
        "thumb": "http:\/\/respondcms.com\/files\/serene.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Sidebar",
        "description": "The sidebar theme features a fixed sidebar to navigate your site.",
        "text": "SidebarThe Sidebar theme features a fixed sidebar to navigate your site.&nbsp;&nbsp;The Sidebar theme has built-in support for all of&nbsp;Respond's built-in functionality including Search,&nbsp;Payments, and more.&nbsp;With 50+ configurations, you can quickly shape notion to match your brand.Theme DemoUnlimited SitesFREEThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/sidebar",
        "photo": "http:\/\/respondcms.com\/files\/sidebar.png",
        "thumb": "http:\/\/respondcms.com\/files\/sidebar.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Tension",
        "description": "Tension is a premium theme from Triangulate featuring unique off-canvas navigation.",
        "text": "TensionThe Tension theme from&nbsp;Respond&nbsp;showcases a unique push-and-pull form of off-canvas navigation. &nbsp;The primary menu pushes onto the screen from the left. &nbsp;And, the&nbsp;secondary menu (containing search, settings, and the cart) pull onto the screen from the right. &nbsp;With 50+ configurations, you can quickly shape notion to match your brand.Theme DemoUnlimited SitesFreeThe theme is distributed along with Respond CMS.",
        "keywords": "",
        "callout": "",
        "url": "theme\/tension",
        "photo": "http:\/\/respondcms.com\/files\/tension.png",
        "thumb": "http:\/\/respondcms.com\/files\/tension.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Throwback",
        "description": "Throwback is a classic theme with a modern twist.  Built for Respond by the creators of Respond.",
        "text": "ThrowbackThrowback is a classic theme with a modern twist. Built for Respond by the creators of Respond.&nbsp;With over 50 point-and-click configurations built-in to the the theme, you can quickly make the Executive theme your own without ever touching any code.Theme DemoUnlimited SitesFreePurchases and downloads facilitated by&nbsp;Sellfy. &nbsp;Pay with either Paypal or Credit Card. &nbsp;Unlimited license is&nbsp;limited to a single&nbsp;Respond&nbsp;installation.",
        "keywords": "",
        "callout": "",
        "url": "theme\/throwback",
        "photo": "http:\/\/respondcms.com\/files\/thowback.png",
        "thumb": "http:\/\/respondcms.com\/files\/thowback.png",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    },
    {
        "title": "Respond - Learn how to use Respond",
        "description": "Welcome to your new homepage created with Respond",
        "text": "Videos The videos will walk you through using Respond on a day-to-day basis to create sites, update content, and change the look-and-feel of your sites. Creating a site with Respond This video walks you through creating a site with Respond CMS. &nbsp;Creating a site is as easy as adding your site name, typing in an email and password, and selecting a theme. &nbsp;In under a minute, you will have a beautiful responsive website. Updating and creating content using the Respond editor This video will walk you through updating and creating content using the Respond CMS editor. &nbsp;Updating content is as easy as clicking and typing the new content in the application. &nbsp;You can add content by dragging and dropping widgets from the top menu bar. Configuring your theme This video will walk you through configuring the look-and-feel of your site using the new theme configuration tool in Respond. Changing your theme This video will walk you through changing your theme using Respond CMS. &nbsp;By changing your theme you can alter the entire look-and-feel of your site. &nbsp;This video also showcases some great themes available in our&nbsp;marketplace. 100% open source, always. Built by Matthew Smith in Manchester, MO. Respond 6 is an open source, responsive content management system built on the Lumen PHP and Angular 2 frameworks. Respond 6 is built so that you can quickly build beautiful, responsive websites. The latest version features flat-file storage, a beautiful visual editor, and fast static sites. HomeBlogAboutContact",
        "keywords": "",
        "callout": "",
        "url": "videos",
        "photo": "",
        "thumb": "",
        "language": "en",
        "direction": "ltr",
        "firstName": "New",
        "lastName": "User",
        "lastModifiedBy": "matt@matthewsmith.com",
        "lastModifiedDate": "2016-06-24T22:44:49.0Z"
    }
]